# Pandas #

- is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,

- built on top of the Python programming language.

In [2]:
# imports!
import pandas as pd 
import numpy as np

## Series ##

In [81]:
l1 = pd.Series([1,2,3]) #Series defined from a list
l1

0    1
1    2
2    3
dtype: int64

In [82]:
# series back to numpy
l1.values

array([1, 2, 3])

In [83]:
l2 = pd.Series(np.array([1,2,3,4,5,6,7,8])) #Series defined from an array
l2

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [84]:
type(l2)

pandas.core.series.Series

In [85]:
l3 = pd.Series(np.array([1,3,5,7,'',9,11])) #Series can have mixed datatypes, though it would allow only operations on them
print('pandas l3:\n',l3)
print('mean:', l3.mean()) # empty string is a valid value - treated as if zero
print('max:', l3.max())

# Though below would throw an error and not allowed. 
#l4 = pd.Series(np.array([1,'Sandeep',4]))
#l4.mean()

pandas l3:
 0     1
1     3
2     5
3     7
4
5     9
6    11
dtype: object
mean: 193987.2857142857
max: 9

In [86]:
l3.replace("1","2") #multiple funtions like replace available

0     2
1     3
2     5
3     7
4
5     9
6    11
dtype: object

In [87]:
print('#indexing allowed to access the data:',l3[0]) #indexing allowed to access the data
print('#datatype post basic indexing:', type(l3[0]))
print('#DEFAULT series index defined as:', l3.index)
print('#post defined indexing #1:', l3[0:3])
print('#post defined indexing #2:', l3[2:])
print('#post defined indexing #3:', l3[:-1])
print('#post defined indexing #4:', l3[1:-1:2])
print('#post defined indexing #5:', l3[::2])

#indexing allowed to access the data: 1
#datatype post basic indexing: <class 'str'>
#DEFAULT series index defined as: RangeIndex(start=0, stop=7, step=1)
#post defined indexing #1: 0    1
1    3
2    5
dtype: object
#post defined indexing #2: 2     5
3     7
4
5     9
6    11
dtype: object
#post defined indexing #3: 0    1
1    3
2    5
3    7
4
5    9
dtype: object
#post defined indexing #4: 1    3
3    7
5    9
dtype: object
#post defined indexing #5: 0     1
2     5
4
6    11
dtype: object

In [88]:
l4 = pd.Series([1,3,5,7,9], index=['A','B','C','D','E']) # CUSTOM index defined
print('l4[''A'']:',l4['A']) # case-sensitive l4['a'] NOT allowed
print('l4[''B'']:',l4['B']) 
print('l4[''C'']:',l4['C']) 
print('l4[''B'':''D'']:',l4['B':'D']) #Range indexing on custom index allowed

l4[A]: 1
l4[B]: 3
l4[C]: 5
l4[B:D]: B    3
C    5
D    7
dtype: int64

## Dataframes ##

*** Dataframe from list of tuples ***

In [89]:
name = ['Sandeep','Murari','Niya','John','Swarnima']
age = [35, 25, 30, 33, 23]

people = list (zip(name,age))
print(people)
df = pd.DataFrame(data=people, columns=['Name','Age'])
df

[('Sandeep', 35), ('Murari', 25), ('Niya', 30), ('John', 33), ('Swarnima', 23)]

       Name  Age
0   Sandeep   35
1    Murari   25
2      Niya   30
3      John   33
4  Swarnima   23

In [90]:
df.rank() # compute numerical data ranks (1 through n) along axis

   Name  Age
0   4.0  5.0
1   2.0  2.0
2   3.0  3.0
3   1.0  4.0
4   5.0  1.0

*** Data Retrieval from Data Frames ***

In [91]:
# rows can be retrieved via index
df.iloc[0]

Name    Sandeep
Age          35
Name: 0, dtype: object

In [92]:
# columns can be retrieved using names
df ["Name"]

0     Sandeep
1      Murari
2        Niya
3        John
4    Swarnima
Name: Name, dtype: object

In [93]:
print(type(df["Age"])) #each column is a Series!
print("Index access in a Series:",df["Name"][0])

<class 'pandas.core.series.Series'>
Index access in a Series: Sandeep

In [94]:
# index is not unique. Thus, when accessed, if multiple values - gives all
findme = pd.Series(["LEARN","BY","INSIGTH"])
findme = findme.append(pd.Series(["INSIGHT","BY","LEARN"]), ignore_index=True)
findme = findme.append(pd.Series(["LEARNBYINSIGHT"])) #resets index by default on append
print(findme)
print("Row access of Series using index directly:\n",findme[0]) # returns both values (visible)
print("Row access of Series using iloc:\n", findme.iloc[6]) # returns actual index (assume hidden unique)

0             LEARN
1                BY
2           INSIGTH
3           INSIGHT
4                BY
5             LEARN
0    LEARNBYINSIGHT
dtype: object
Row access of Series using index directly:
 0             LEARN
0    LEARNBYINSIGHT
dtype: object
Row access of Series using iloc:
 LEARNBYINSIGHT

In [95]:
df.info() # basic info about dataframe, generally first thing to gauge about

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [96]:
df2 = pd.DataFrame(data=people)
df2[0] #only allowed when columns are not defined. Thus, df[0] will throw error as Name, Age defined.

0     Sandeep
1      Murari
2        Niya
3        John
4    Swarnima
Name: 0, dtype: object

In [97]:
#Can define any column as index
df.set_index('Name', inplace=True)
df

          Age
Name
Sandeep    35
Murari     25
Niya       30
John       33
Swarnima   23

In [98]:
# cannot do df['Sandeep'] - its not an accessible index
# range around them can be done
df['Sandeep':'Niya']

         Age
Name
Sandeep   35
Murari    25
Niya      30

In [99]:
#loc access can be done (SEE: loc and not iloc => no more numerical index)
df.loc['Sandeep']

Age    35
Name: Sandeep, dtype: int64

In [100]:
#df['Name'] => NOT allowed. No more a column but index
df['Age'] # => Allowed

Name
Sandeep     35
Murari      25
Niya        30
John        33
Swarnima    23
Name: Age, dtype: int64

*** Dataframe from a dictionary ***

In [101]:
educated_dict = { 'Country': [ 'India', 'China', 'United States', 'Malaysia' ],
                  'Educated' : [200001234, 300001234, 100001234, 20001234] }

for k,v in educated_dict.items():
    print (k,v)

df2 = pd.DataFrame(educated_dict)
df2

Country ['India', 'China', 'United States', 'Malaysia']
Educated [200001234, 300001234, 100001234, 20001234]

         Country   Educated
0          India  200001234
1          China  300001234
2  United States  100001234
3       Malaysia   20001234

In [102]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Country   4 non-null      object
 1   Educated  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [103]:
#df.head() => would give entire data back
df2.head(2)

  Country   Educated
0   India  200001234
1   China  300001234

In [104]:
df2.sample(2) #any 
# df2.tail()  # similar commands

    Country   Educated
1     China  300001234
3  Malaysia   20001234

In [105]:
df2["Country"]

0            India
1            China
2    United States
3         Malaysia
Name: Country, dtype: object

*** Dataframe from CSV ***

In [106]:
# The option sep="," is used to indicate field separators
# The file name can be replaced with a URL
df3 = pd.read_csv('./data-files/pandas/population.csv',sep=",") 
df3.head()

  Country Name Country Code  Year        Value
0   Arab World          ARB  1960   92490932.0
1   Arab World          ARB  1961   95044497.0
2   Arab World          ARB  1962   97682294.0
3   Arab World          ARB  1963  100411076.0
4   Arab World          ARB  1964  103239902.0

In [107]:
df3.info() #get the jist of data => 14885 rows :thumbsup:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14885 entries, 0 to 14884
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  14885 non-null  object
 1   Country Code  14885 non-null  object
 2   Year          14885 non-null  int64
 3   Value         14885 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 465.3+ KB

In [108]:
# Random sample of 20 distinct countries from the list
uniqueCountries = df3['Country Name'].unique()
np.random.choice(uniqueCountries, 20)

array(['Bosnia and Herzegovina', 'Poland', 'Belize', 'Dominican Republic',
       'Lao PDR', 'Brunei Darussalam', 'Indonesia', 'Haiti', 'Nicaragua',
       'Croatia', 'Sub-Saharan Africa (IDA & IBRD countries)', 'Thailand',
       'Aruba', 'Zambia', 'West Bank and Gaza', 'Uzbekistan',
       'East Asia & Pacific', 'Latvia', 'Gambia, The', 'Chile'],
      dtype=object)

In [109]:
# df3.iloc[0:4]
# The general for of iloc is df.iloc[ row_indexer , col_indexer].
# explicit column selection
df3.iloc[ 0:4, [1,3] ] # same as df3.iloc[ :4, range(1,3) ]

# iloc does not support label-based access. In this case we must drop use loc.
# df.iloc[ 0:1, ['Year','Value']  ] => Invalid

  Country Code        Value
0          ARB   92490932.0
1          ARB   95044497.0
2          ARB   97682294.0
3          ARB  100411076.0

In [110]:
# Boolean Indexing => MASKING
# We select rows that satisfy those boolean conditions (one or multiple) 
# Boolean index can be made from a combination of logical operators of AND &, OR |, NOT ~.
bool1 = df3['Value']>1000000000
bool2 = df3['Year']>2000
df3[bool1 & bool2].sample(5)

                    Country Name Country Code  Year         Value
1931                OECD members          OED  2010  1.242392e+09
226   Early-demographic dividend          EAR  2015  3.127290e+09
905                    IBRD only          IBD  2010  4.427798e+09
1139                   IDA total          IDA  2016  1.574346e+09
224   Early-demographic dividend          EAR  2013  3.040241e+09

In [111]:
# isin is a useful operator when building a boolean index
selection_condition_3 = df3['Country Name'].isin( ['China','India'] )
df3[selection_condition_3].sample(5)

     Country Name Country Code  Year         Value
7682        India          IND  2009  1.214270e+09
7646        India          IND  1973  5.930589e+08
7669        India          IND  1996  9.788932e+08
7677        India          IND  2004  1.126136e+09
4991        China          CHN  1992  1.164970e+09

In [112]:
# where is useful when we want to retain the shape of the original table.
# The values that dont match the selection critieria are set to NaN
df3b = df3.where(df3['Year']>2011)
df3b

      Country Name Country Code    Year       Value
0              NaN          NaN     NaN         NaN
1              NaN          NaN     NaN         NaN
2              NaN          NaN     NaN         NaN
3              NaN          NaN     NaN         NaN
4              NaN          NaN     NaN         NaN
...            ...          ...     ...         ...
14880     Zimbabwe          ZWE  2012.0  14710826.0
14881     Zimbabwe          ZWE  2013.0  15054506.0
14882     Zimbabwe          ZWE  2014.0  15411675.0
14883     Zimbabwe          ZWE  2015.0  15777451.0
14884     Zimbabwe          ZWE  2016.0  16150362.0

[14885 rows x 4 columns]

In [113]:
print((df3.describe().mean()).Value)
print((df3.describe().std()).Value)

1046482586.2543526
2594636650.4484024

In [114]:
# countries whose GDP is more than three standard deviations from the average
con1 = df3['Value'] > (-df3.describe().mean()).Value + 3*(df3.describe().std()).Value
df3[con1]

     Country Name Country Code  Year         Value
2613        World          WLD  2008  6.763746e+09
2614        World          WLD  2009  6.847215e+09
2615        World          WLD  2010  6.930657e+09
2616        World          WLD  2011  7.012844e+09
2617        World          WLD  2012  7.097401e+09
2618        World          WLD  2013  7.182860e+09
2619        World          WLD  2014  7.268986e+09
2620        World          WLD  2015  7.355220e+09
2621        World          WLD  2016  7.442136e+09

*** Dataframe from Built-in dataset ***

Packages like sklearn and seaborn come with practice datasets

In [115]:
#Pandas dataframe from iris dataset
from sklearn.datasets import load_iris

iris = load_iris()
print(iris.feature_names) # dataset features 
print(iris.data.shape) # metdata
print(type(iris.data)) # data type

['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']
(150, 4)
<class 'numpy.ndarray'>

In [116]:
# Create a pandas dataframe with iris data

df_iris = pd.DataFrame(data=iris.data, columns=iris.feature_names)
df_iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [117]:
# df_iris.columns
df_iris.info() # dataframe metadata

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [118]:
df_iris.describe() # summary of numerical columns
# df.describe(include='all') # some info for string datatype also

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

*** Modifying data in dataframe ***

In [119]:
df_marks = pd.read_csv('./data-files/pandas/studentmarks2.csv', sep=",", header=None)
df_marks

         0       1       2
0  sandeep  30.666  45.000
1   swetha  30.666  30.000
2     niya  40.250  25.000
3  swarima  20.000  15.000
4     siva  15.000  34.666
5    lalit  20.000  20.000
6     john  37.000  20.000
7   murari  40.250  15.000
8   sanjay  20.000  20.000
9      sri  20.000  29.000

In [120]:
# setup column names for easy reference
df_marks.columns = ['Name', 'Marks1', 'Marks2']
df_marks

      Name  Marks1  Marks2
0  sandeep  30.666  45.000
1   swetha  30.666  30.000
2     niya  40.250  25.000
3  swarima  20.000  15.000
4     siva  15.000  34.666
5    lalit  20.000  20.000
6     john  37.000  20.000
7   murari  40.250  15.000
8   sanjay  20.000  20.000
9      sri  20.000  29.000

In [121]:
df_marks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks1  10 non-null     float64
 2   Marks2  10 non-null     float64
dtypes: float64(2), object(1)
memory usage: 368.0+ bytes

In [122]:
# Add two new students to the existing data.
df_marks = df_marks.append(pd.DataFrame([['pratul',18,20],['pradeep',25,25] ], columns=['Name','Marks1','Marks2']))
df_marks

      Name  Marks1  Marks2
0  sandeep  30.666  45.000
1   swetha  30.666  30.000
2     niya  40.250  25.000
3  swarima  20.000  15.000
4     siva  15.000  34.666
5    lalit  20.000  20.000
6     john  37.000  20.000
7   murari  40.250  15.000
8   sanjay  20.000  20.000
9      sri  20.000  29.000
0   pratul  18.000  20.000
1  pradeep  25.000  25.000

In [123]:
# Notice that there are common index for two students. 
# 
# There are two ways to avoid this situation:
# Either use ignore_index=True option when appending or reset the index as shown below
# df_marks = df_marks.append(pd.DataFrame( [ ['pratul',18,20],['pradeep',25,25] ], columns=['Name','Marks1','Marks2']), ignore_index=True)
df_marks.reset_index() # # This method does not change df_marks until assigned

    index     Name  Marks1  Marks2
0       0  sandeep  30.666  45.000
1       1   swetha  30.666  30.000
2       2     niya  40.250  25.000
3       3  swarima  20.000  15.000
4       4     siva  15.000  34.666
5       5    lalit  20.000  20.000
6       6     john  37.000  20.000
7       7   murari  40.250  15.000
8       8   sanjay  20.000  20.000
9       9      sri  20.000  29.000
10      0   pratul  18.000  20.000
11      1  pradeep  25.000  25.000

In [124]:
df_marks.iloc[7]

Name      murari
Marks1     40.25
Marks2        15
Name: 7, dtype: object

In [125]:
# add a new column of total marks (derived column)
df_marks["Total"] = df_marks["Marks1"]+df_marks["Marks2"]
df_marks

# few more examples
# df_marks['newCriter'] = df_marks['Marks1']*.5+ df_marks['Marks2']
# df_marks['copy'] = df_marks['Total']
# del df['copy']

      Name  Marks1  Marks2   Total
0  sandeep  30.666  45.000  75.666
1   swetha  30.666  30.000  60.666
2     niya  40.250  25.000  65.250
3  swarima  20.000  15.000  35.000
4     siva  15.000  34.666  49.666
5    lalit  20.000  20.000  40.000
6     john  37.000  20.000  57.000
7   murari  40.250  15.000  55.250
8   sanjay  20.000  20.000  40.000
9      sri  20.000  29.000  49.000
0   pratul  18.000  20.000  38.000
1  pradeep  25.000  25.000  50.000

In [126]:
# assign names as the index
df_marks.set_index(keys=['Name'], inplace=True) # In order to modify the table use the option inplace=True.
df_marks

         Marks1  Marks2   Total
Name
sandeep  30.666  45.000  75.666
swetha   30.666  30.000  60.666
niya     40.250  25.000  65.250
swarima  20.000  15.000  35.000
siva     15.000  34.666  49.666
lalit    20.000  20.000  40.000
john     37.000  20.000  57.000
murari   40.250  15.000  55.250
sanjay   20.000  20.000  40.000
sri      20.000  29.000  49.000
pratul   18.000  20.000  38.000
pradeep  25.000  25.000  50.000

In [127]:
# reset back to normal indexes
df_marks.reset_index(inplace=True)
df_marks

       Name  Marks1  Marks2   Total
0   sandeep  30.666  45.000  75.666
1    swetha  30.666  30.000  60.666
2      niya  40.250  25.000  65.250
3   swarima  20.000  15.000  35.000
4      siva  15.000  34.666  49.666
5     lalit  20.000  20.000  40.000
6      john  37.000  20.000  57.000
7    murari  40.250  15.000  55.250
8    sanjay  20.000  20.000  40.000
9       sri  20.000  29.000  49.000
10   pratul  18.000  20.000  38.000
11  pradeep  25.000  25.000  50.000

In [128]:
# Sorting based on a list of columns is easy. This however does not modify the dataframe.
# In order to modify the table use the option inplace=True.

df_marks.sort_values(by=['Total','Marks1'],ascending=[False,True])

       Name  Marks1  Marks2   Total
0   sandeep  30.666  45.000  75.666
2      niya  40.250  25.000  65.250
1    swetha  30.666  30.000  60.666
6      john  37.000  20.000  57.000
7    murari  40.250  15.000  55.250
11  pradeep  25.000  25.000  50.000
4      siva  15.000  34.666  49.666
9       sri  20.000  29.000  49.000
5     lalit  20.000  20.000  40.000
8    sanjay  20.000  20.000  40.000
10   pratul  18.000  20.000  38.000
3   swarima  20.000  15.000  35.000

In [129]:
df_marks.drop("Total", axis=1)  # not done inplace

       Name  Marks1  Marks2
0   sandeep  30.666  45.000
1    swetha  30.666  30.000
2      niya  40.250  25.000
3   swarima  20.000  15.000
4      siva  15.000  34.666
5     lalit  20.000  20.000
6      john  37.000  20.000
7    murari  40.250  15.000
8    sanjay  20.000  20.000
9       sri  20.000  29.000
10   pratul  18.000  20.000
11  pradeep  25.000  25.000

In [130]:
df_marks

       Name  Marks1  Marks2   Total
0   sandeep  30.666  45.000  75.666
1    swetha  30.666  30.000  60.666
2      niya  40.250  25.000  65.250
3   swarima  20.000  15.000  35.000
4      siva  15.000  34.666  49.666
5     lalit  20.000  20.000  40.000
6      john  37.000  20.000  57.000
7    murari  40.250  15.000  55.250
8    sanjay  20.000  20.000  40.000
9       sri  20.000  29.000  49.000
10   pratul  18.000  20.000  38.000
11  pradeep  25.000  25.000  50.000

*** Groupby Operation ***

In [131]:
df_marks['Grade'] = ['First','Fourth','Fourth','Third',"Third","Third","Second","Second","Second","Third","Second","Second" ]
df_marks

       Name  Marks1  Marks2   Total   Grade
0   sandeep  30.666  45.000  75.666   First
1    swetha  30.666  30.000  60.666  Fourth
2      niya  40.250  25.000  65.250  Fourth
3   swarima  20.000  15.000  35.000   Third
4      siva  15.000  34.666  49.666   Third
5     lalit  20.000  20.000  40.000   Third
6      john  37.000  20.000  57.000  Second
7    murari  40.250  15.000  55.250  Second
8    sanjay  20.000  20.000  40.000  Second
9       sri  20.000  29.000  49.000   Third
10   pratul  18.000  20.000  38.000  Second
11  pradeep  25.000  25.000  50.000  Second

In [132]:
df_marks['Grade'].value_counts() #groups by column value and provides count sorted

Second    5
Third     4
Fourth    2
First     1
Name: Grade, dtype: int64

In [133]:
# Mean score of student by grade
#df_gradeSecond = df_marks[['Marks1', 'Marks2']] # new data frame from two of the columns of existing dataframe
df_grade = df_marks[['Marks1', 'Marks2']].groupby(df_marks['Grade'])
df_grade

In [134]:
# We can apply aggregate operations like count, sum, max, min, mean, etc. on a group by object
print(df_grade.mean())
print(df_grade.count())

Marks1   Marks2
Grade
First   30.666  45.0000
Fourth  35.458  27.5000
Second  28.050  20.0000
Third   18.750  24.6665
        Marks1  Marks2
Grade
First        1       1
Fourth       2       2
Second       5       5
Third        4       4

*** Custom Functions: Apply Method ***

apply allows to manipulate data using custom function.

In [135]:
# standard deviation of the marks. There is no built-in aggregate function for std. dev but we can use a fuction from numpy.

df_grade.apply(np.std)

          Marks1    Marks2
Grade
First   0.000000  0.000000
Fourth  4.792000  2.500000
Second  8.989438  3.162278
Third   2.165064  7.648311

In [136]:
# Example: apply on columns
# Capitalize all the names of student 
# using custom function 
def DoCapital(c):
    return c.capitalize()

df_marks['Name'].apply(DoCapital)

0     Sandeep
1      Swetha
2        Niya
3     Swarima
4        Siva
5       Lalit
6        John
7      Murari
8      Sanjay
9         Sri
10     Pratul
11    Pradeep
Name: Name, dtype: object

In [137]:
# Example: apply on rows
# using the option axis=1 or axis='columns'
# average marks of students
def FindAvg(row):
    return (row['Marks1']+row['Marks2'])/2

df_marks['Avergage'] = df_marks.apply(FindAvg,axis=1)
df_marks

       Name  Marks1  Marks2   Total   Grade  Avergage
0   sandeep  30.666  45.000  75.666   First    37.833
1    swetha  30.666  30.000  60.666  Fourth    30.333
2      niya  40.250  25.000  65.250  Fourth    32.625
3   swarima  20.000  15.000  35.000   Third    17.500
4      siva  15.000  34.666  49.666   Third    24.833
5     lalit  20.000  20.000  40.000   Third    20.000
6      john  37.000  20.000  57.000  Second    28.500
7    murari  40.250  15.000  55.250  Second    27.625
8    sanjay  20.000  20.000  40.000  Second    20.000
9       sri  20.000  29.000  49.000   Third    24.500
10   pratul  18.000  20.000  38.000  Second    19.000
11  pradeep  25.000  25.000  50.000  Second    25.000

*** Pre-Processing ***

Few functions in Pandas that are handy in converting a raw table to the required format

In [3]:
# sample dataset of tshirts to play around
# datafile: tshirts.csv
df_tshirts = pd.read_csv('./data-files/pandas/tshirts.csv', sep=",")
df_tshirts

     Brand Size  Color   Price
0   Adidas  XXL   Blue  1400.0
1   Adidas   XL    Red  1200.0
2    Arrow  XXL  Black  2450.0
3    Arrow    M   Blue     NaN
4      NaN    M   Blue   500.0
5   Adidas    L  Green  1200.0
6    Arrow   XL   Blue  2400.0
7    Arrow    M   Blue  1400.0
8    Arrow    M   Blue  2400.0
9     Puma   XL   Blue  2400.0
10    Puma    M   Blue  1400.0
11   Arrow   XL    Red  1200.0
12   Arrow    L  Green  1200.0
13    Puma    M   Blue  2400.0
14    Puma   XL    Red  2200.0
15  Adidas  XXL  Black     NaN
16    Puma  XXL  Black  2450.0
17    Puma    M   Blue  1000.0
18    Puma    L  Green  3200.0

In [4]:
# Quick observation: 
# # 1. 19 rows
# # 2. Column Brand has 1 NaN
# # 3. Column Price has 2 NaN
df_tshirts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Brand   18 non-null     object
 1   Size    19 non-null     object
 2   Color   19 non-null     object
 3   Price   17 non-null     float64
dtypes: float64(1), object(3)
memory usage: 736.0+ bytes

**** How to handle the missing value? ****

In [6]:
#1. DROP them
# viable option if no of rows getting impacted is comparitively ignorable if removed
# dropna()

df_tshirts_drop = df_tshirts.copy()
df_tshirts_drop.head(3)

    Brand Size  Color   Price
0  Adidas  XXL   Blue  1400.0
1  Adidas   XL    Red  1200.0
2   Arrow  XXL  Black  2450.0

In [8]:
# handy function dropna
df_tshirts_drop.dropna( subset=['Brand','Price'] , inplace = True)
df_tshirts_drop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16 entries, 0 to 18
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Brand   16 non-null     object
 1   Size    16 non-null     object
 2   Color   16 non-null     object
 3   Price   16 non-null     float64
dtypes: float64(1), object(3)
memory usage: 640.0+ bytes

In [13]:
#2. Replace with mean
# viable option for mostly handling missing numeric values 
# if data is random and not particular visible relation in place
# fillna()
df_tshirts_fill = df_tshirts.copy()
df_tshirts_fill['Price'].fillna(df_tshirts_fill['Price'].mean(), inplace=True)
df_tshirts_fill

     Brand Size  Color        Price
0   Adidas  XXL   Blue  1400.000000
1   Adidas   XL    Red  1200.000000
2    Arrow  XXL  Black  2450.000000
3    Arrow    M   Blue  1788.235294
4      NaN    M   Blue   500.000000
5   Adidas    L  Green  1200.000000
6    Arrow   XL   Blue  2400.000000
7    Arrow    M   Blue  1400.000000
8    Arrow    M   Blue  2400.000000
9     Puma   XL   Blue  2400.000000
10    Puma    M   Blue  1400.000000
11   Arrow   XL    Red  1200.000000
12   Arrow    L  Green  1200.000000
13    Puma    M   Blue  2400.000000
14    Puma   XL    Red  2200.000000
15  Adidas  XXL  Black  1788.235294
16    Puma  XXL  Black  2450.000000
17    Puma    M   Blue  1000.000000
18    Puma    L  Green  3200.000000

In [ ]:
#3. Replace with most frequent item
# viable option for mostly handling missing string values 
# mode() - returns a list so we use 0 to pick the first value
# fillna()

In [28]:
df_tshirts_fill2 = df_tshirts.copy()
df_tshirts_fill2['Brand'].mode()

0    Arrow
1     Puma
dtype: object

In [29]:
#pick any one and fill in to move
df_tshirts_fill2['Brand'].fillna( df_tshirts_fill2['Brand'].mode()[1] , inplace=True)
df_tshirts_fill2

     Brand Size  Color   Price
0   Adidas  XXL   Blue  1400.0
1   Adidas   XL    Red  1200.0
2    Arrow  XXL  Black  2450.0
3    Arrow    M   Blue     NaN
4     Puma    M   Blue   500.0
5   Adidas    L  Green  1200.0
6    Arrow   XL   Blue  2400.0
7    Arrow    M   Blue  1400.0
8    Arrow    M   Blue  2400.0
9     Puma   XL   Blue  2400.0
10    Puma    M   Blue  1400.0
11   Arrow   XL    Red  1200.0
12   Arrow    L  Green  1200.0
13    Puma    M   Blue  2400.0
14    Puma   XL    Red  2200.0
15  Adidas  XXL  Black     NaN
16    Puma  XXL  Black  2450.0
17    Puma    M   Blue  1000.0
18    Puma    L  Green  3200.0

In [30]:
#4. Replace with mean value of a group
# viable option for mostly handling missing numeric values 
# if data has particular visible relation in place
# fillna()

# price means by brand
df_pmbb = df_tshirts_fill2.groupby('Brand')['Price'].mean()
df_pmbb

Brand
Adidas    1266.666667
Arrow     1841.666667
Puma      1943.750000
Name: Price, dtype: float64

In [31]:
def fill_missing(f):
    f_mean = f.mean()
    return f.fillna( f_mean )

df_fillbygroup = df_tshirts_fill2.groupby(['Brand'])['Price'] # splits into three Series objects-one for each brand
df_fillbygroup.transform( fill_missing ) #passes each of the three Series objects one by one to the function fill_missing & then combines back into one series

0     1400.000000
1     1200.000000
2     2450.000000
3     1841.666667
4      500.000000
5     1200.000000
6     2400.000000
7     1400.000000
8     2400.000000
9     2400.000000
10    1400.000000
11    1200.000000
12    1200.000000
13    2400.000000
14    2200.000000
15    1266.666667
16    2450.000000
17    1000.000000
18    3200.000000
Name: Price, dtype: float64

In [34]:
#5. Convert categories (strings) into numbers - easier to work across
# Meaningful order (ORDINAL feature)
# here size can be low to high. 

size_number = {
    'S':0,
    'M':1,
    'L':2,
    'XL':3,
    'XXL':4
}

df_of = df_tshirts.copy()
df_of['Size'] = df_of['Size'].apply(lambda x: size_number[x]) # reassign as apply does not have inplace=True
df_of

     Brand  Size  Color   Price
0   Adidas     4   Blue  1400.0
1   Adidas     3    Red  1200.0
2    Arrow     4  Black  2450.0
3    Arrow     1   Blue     NaN
4      NaN     1   Blue   500.0
5   Adidas     2  Green  1200.0
6    Arrow     3   Blue  2400.0
7    Arrow     1   Blue  1400.0
8    Arrow     1   Blue  2400.0
9     Puma     3   Blue  2400.0
10    Puma     1   Blue  1400.0
11   Arrow     3    Red  1200.0
12   Arrow     2  Green  1200.0
13    Puma     1   Blue  2400.0
14    Puma     3    Red  2200.0
15  Adidas     4  Black     NaN
16    Puma     4  Black  2450.0
17    Puma     1   Blue  1000.0
18    Puma     2  Green  3200.0

In [35]:
#6. Convert categories (strings) into numbers - easier to work across
# Random - cannot be ordered (NOMINAL feature)
# here Colors are example of it
# represent each unique color as a (dummy) feature of its own
# Once transformed, for every data point, exactly one feature has the value 1 and the rest of them have zero. 
# This representation is known as one-hot encoding

df_nf = df_of.copy()
df_nf_onehotencoded = pd.get_dummies(df_nf, columns=['Color'], drop_first=True) #drop_first will remove the string column
df_nf_onehotencoded

     Brand  Size   Price  Color_Blue  Color_Green  Color_Red
0   Adidas     4  1400.0           1            0          0
1   Adidas     3  1200.0           0            0          1
2    Arrow     4  2450.0           0            0          0
3    Arrow     1     NaN           1            0          0
4      NaN     1   500.0           1            0          0
5   Adidas     2  1200.0           0            1          0
6    Arrow     3  2400.0           1            0          0
7    Arrow     1  1400.0           1            0          0
8    Arrow     1  2400.0           1            0          0
9     Puma     3  2400.0           1            0          0
10    Puma     1  1400.0           1            0          0
11   Arrow     3  1200.0           0            0          1
12   Arrow     2  1200.0           0            1          0
13    Puma     1  2400.0           1            0          0
14    Puma     3  2200.0           0            0          1
15  Adidas     4     NaN           0            0          0
16    Puma     4  2450.0           0            0          0
17    Puma     1  1000.0           1            0          0
18    Puma     2  3200.0           0            1          0